Revit 2027 API
BuiltInFailures.CreationFailures.CannotMakeWall Property
 Can't make Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeWall { get; }
Public Shared ReadOnly Property CannotMakeWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeWall {
	FailureDefinitionId^ get ();
}
static member CannotMakeWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace